{"format": "layers-model", "generatedBy": "keras v2.11.0", "convertedBy": "TensorFlow.js Converter v4.3.0", "modelTopology": {"keras_version": "2.11.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 8, 8, 14], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "Conv2D-65709", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}, "shared_object_id": 1}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D-65709", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D-956739", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}, "shared_object_id": 1}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D-956739", "inbound_nodes": [[["Conv2D-65709", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Add-200973", "trainable": true, "dtype": "float32"}, "name": "Add-200973", "inbound_nodes": [[["Conv2D-65709", 0, 0, {}], ["Conv2D-956739", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D-621893", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}, "shared_object_id": 1}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D-621893", "inbound_nodes": [[["Add-200973", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D-858150", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}, "shared_object_id": 1}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D-858150", "inbound_nodes": [[["Conv2D-621893", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Add-195569", "trainable": true, "dtype": "float32"}, "name": "Add-195569", "inbound_nodes": [[["Conv2D-621893", 0, 0, {}], ["Conv2D-858150", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D-635729", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}, "shared_object_id": 1}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D-635729", "inbound_nodes": [[["Add-195569", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D-161688", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}, "shared_object_id": 1}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D-161688", "inbound_nodes": [[["Conv2D-635729", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Add-273557", "trainable": true, "dtype": "float32"}, "name": "Add-273557", "inbound_nodes": [[["Conv2D-635729", 0, 0, {}], ["Conv2D-161688", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D-343390", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}, "shared_object_id": 1}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D-343390", "inbound_nodes": [[["Add-273557", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D-69546", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}, "shared_object_id": 1}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D-69546", "inbound_nodes": [[["Conv2D-343390", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Add-562770", "trainable": true, "dtype": "float32"}, "name": "Add-562770", "inbound_nodes": [[["Conv2D-343390", 0, 0, {}], ["Conv2D-69546", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "Flatten-471086", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "Flatten-471086", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "Flatten-120917", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "Flatten-120917", "inbound_nodes": [[["Add-562770", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "Concat-247884", "trainable": true, "dtype": "float32", "axis": -1}, "name": "Concat-247884", "inbound_nodes": [[["Flatten-471086", 0, 0, {}], ["Flatten-120917", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Dense-951093", "trainable": true, "dtype": "float32", "units": 1024, "activation": {"class_name": "ELU", "config": {"name": "elu", "trainable": true, "dtype": "float32", "alpha": 1.0}, "shared_object_id": 25}, "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}, "shared_object_id": 1}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Dense-951093", "inbound_nodes": [[["Concat-247884", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "Concat-716325", "trainable": true, "dtype": "float32", "axis": -1}, "name": "Concat-716325", "inbound_nodes": [[["Flatten-471086", 0, 0, {}], ["Dense-951093", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Dense-473800", "trainable": true, "dtype": "float32", "units": 512, "activation": {"class_name": "ELU", "config": {"name": "elu", "trainable": true, "dtype": "float32", "alpha": 1.0}, "shared_object_id": 25}, "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}, "shared_object_id": 1}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Dense-473800", "inbound_nodes": [[["Concat-716325", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "Dense-output-188209", "trainable": true, "dtype": "float32", "axis": -1}, "name": "Dense-output-188209", "inbound_nodes": [[["Flatten-471086", 0, 0, {}], ["Dense-473800", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 1837, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["Dense-output-188209", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of41.bin", "group1-shard2of41.bin", "group1-shard3of41.bin", "group1-shard4of41.bin", "group1-shard5of41.bin", "group1-shard6of41.bin", "group1-shard7of41.bin", "group1-shard8of41.bin", "group1-shard9of41.bin", "group1-shard10of41.bin", "group1-shard11of41.bin", "group1-shard12of41.bin", "group1-shard13of41.bin", "group1-shard14of41.bin", "group1-shard15of41.bin", "group1-shard16of41.bin", "group1-shard17of41.bin", "group1-shard18of41.bin", "group1-shard19of41.bin", "group1-shard20of41.bin", "group1-shard21of41.bin", "group1-shard22of41.bin", "group1-shard23of41.bin", "group1-shard24of41.bin", "group1-shard25of41.bin", "group1-shard26of41.bin", "group1-shard27of41.bin", "group1-shard28of41.bin", "group1-shard29of41.bin", "group1-shard30of41.bin", "group1-shard31of41.bin", "group1-shard32of41.bin", "group1-shard33of41.bin", "group1-shard34of41.bin", "group1-shard35of41.bin", "group1-shard36of41.bin", "group1-shard37of41.bin", "group1-shard38of41.bin", "group1-shard39of41.bin", "group1-shard40of41.bin", "group1-shard41of41.bin"], "weights": [{"name": "Conv2D-161688/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "Conv2D-161688/bias", "shape": [256], "dtype": "float32"}, {"name": "Conv2D-343390/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "Conv2D-343390/bias", "shape": [512], "dtype": "float32"}, {"name": "Conv2D-621893/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "Conv2D-621893/bias", "shape": [128], "dtype": "float32"}, {"name": "Conv2D-635729/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "Conv2D-635729/bias", "shape": [256], "dtype": "float32"}, {"name": "Conv2D-65709/kernel", "shape": [3, 3, 14, 64], "dtype": "float32"}, {"name": "Conv2D-65709/bias", "shape": [64], "dtype": "float32"}, {"name": "Conv2D-69546/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "Conv2D-69546/bias", "shape": [512], "dtype": "float32"}, {"name": "Conv2D-858150/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "Conv2D-858150/bias", "shape": [128], "dtype": "float32"}, {"name": "Conv2D-956739/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "Conv2D-956739/bias", "shape": [64], "dtype": "float32"}, {"name": "Dense-473800/kernel", "shape": [1920, 512], "dtype": "float32"}, {"name": "Dense-473800/bias", "shape": [512], "dtype": "float32"}, {"name": "Dense-951093/kernel", "shape": [33664, 1024], "dtype": "float32"}, {"name": "Dense-951093/bias", "shape": [1024], "dtype": "float32"}, {"name": "dense/kernel", "shape": [1408, 1837], "dtype": "float32"}, {"name": "dense/bias", "shape": [1837], "dtype": "float32"}]}]}